{
  "navbar": {
    "media": "/assets/3d-headshot-lg.png",
    "heading": "Sal Anvarov",
    "email": "msalanvarov@gmail.com",
    "button": {
      "link": "/contact",
      "text": "Contact"
    },
    "profiles": [
      {
        "link": "https://github.com/msanvarov",
        "icon": "iconoir-github"
      },
      {
        "link": "https://linkedin.com/in/sal-anvarov",
        "icon": "iconoir-linkedin"
      },
      {
        "link": "https://dribbble.com/msalanvarov",
        "icon": "iconoir-dribbble"
      },
      {
        "link": "http://www.cleanlist.ai/",
        "icon": "iconoir-brain-research"
      }
    ]
  },
  "bio": {
    "heading": "Who is Sal?",
    "description": [
      "Back in 2016, I decided to try my hand at creating custom Tumblr themes and tumbled head first into the rabbit hole of coding and web development. ",
      "Fast forward to today, I've built products for companies and businesses around the world, ranging from <a href='https://us.mullenlowe.com/' target='_blank' rel='noopener norefferer'>marketing websites</a>, <a href='https://www.hopintech.com/' target='_blank' rel='noopener norefferer'>startups</a>, to <a href='https://www.rbcroyalbank.com/' target='_blank' rel='noopener norefferer'>enterprise apps</a> with focus on fast, elegant and user friendly experiences.",
      "When I'm not coding, I'm regularly playing <a href='https://fbref.com/en/players/34edcab0/Ronaldinho' target='_blank' rel='noopener norefferer'>football</a>, both <a href='https://www.ea.com/en-au/games/ea-sports-fc/fc-24' target='_blank' rel='noopener norefferer'>online</a> and in real life, practicing boxing and making music."
    ]
  },
  "experience": {
    "heading": "Experience",
    "experience": [
      {
        "date": "2022 - Present",
        "title": "Lead Full Stack Developer",
        "company": "Oproma",
        "description": "Focusing on providing a better experience for Oproma clients by delivering high-quality, robust production code for Prividox; an Oproma file management system."
      },
      {
        "date": "2022 - Present",
        "title": "Board Member",
        "company": "Cleanlist.ai",
        "description": "Leading the development efforts in providing an AI powered lead generation platform for Cleanlist.ai clients."
      },
      {
        "date": "10/2020 - 2022",
        "title": "Lead Full Stack Developer",
        "company": "Permion.ai",
        "description": "Helped deliver R&D code to production by building backend API's and frontend applications for Permion.ai clients."
      },
      {
        "date": "01/2020 - 09/2020",
        "title": "Full Stack Development Contractor",
        "company": "Research Capital Corporation",
        "description": "At Research Capital Corporation, key initiatives were led to enhance operational efficiency and data analytics. A sophisticated trade blotter system was developed for precise tracking of electricity trades, alongside the re-architecture of the ML model training pipeline using Python, significantly improving predictive accuracy and efficiency. The reworking of metrics collection using Prefect streamlined data accuracy and efficiency. The establishment of a Kubernetes environment with AWS EKS facilitated the deployment of diverse ML pipelines, ensuring scalability and robust operations. Furthermore, the automation of code deployment through a CI/CD pipeline with GitHub Actions, and the integration of Grafana for advanced data visualization and reporting, provided critical insights for decision-making. These contributions were pivotal in driving technological advancement and operational excellence at the company."
      },
      {
        "date": "2018 - 2020",
        "title": "Full Stack Development Contractor",
        "company": "Hopin Technologies",
        "description": "Developed a client-facing mobile app using React Native and TypeScript to facilitate last-mile transportation logistics for company employees, saving hundreds of labour-hours previously spent on manual data collection. The backend, powered by GCP's Firebase and the Samsara ecosystem, was swiftly prototyped to enable scalable operations, while an upgraded landing page was crafted using React and Gatsby to enhance business appeal to potential clients."
      },
      {
        "date": "2017 - 2018",
        "title": "Backend Development Contractor",
        "company": "Natura Market",
        "description": "Automated deployment processes for easier deployment to production, which also optimized AWS costs during high-traffic hours. Frontend files were fine-tuned for enhanced client experience, and a migration from Magento's query engine extension to Algolia was executed to enhance querying capabilities."
      },
      {
        "date": "04/2016 - 08/2016",
        "title": "Software Developer Co-op",
        "company": "IBM",
        "description": "Developed RPA workflows using .NET technologies, focusing on business process automation for enhanced efficiency. Furthermore, creating applications with C# and .NET Core, and incorporating RPA bots with client systems via Web API 2.0. Enhanced user interfaces with WPF, improving RPA management tools through intuitive design and Redis Caching for performance."
      },
      {
        "date": "01/2016 - 04/2016",
        "title": "Software Developer Co-op",
        "company": "Intuit",
        "description": "Contributed to enhance TurboTax.com, focusing on performance and high throughput. Contributed to refactoring code in languages C#, and Python to help architect resilient and efficient systems, ensuring an uninterrupted and high-quality user experience."
      },
      {
        "date": "04/2015 - 08/2015",
        "title": "Software Developer Co-op",
        "company": "Amazon",
        "description": "Developed web applications to automate and streamline Amazon's sales processes, using JavaScript, HTML, and CSS for intuitive, responsive UIs."
      }
    ]
  },
  "education": {
    "heading": "Education",
    "education": [
      {
        "date": "Professional Certificate",
        "degree": "Meta Front-End Developer",
        "university": "Coursera"
      },
      {
        "date": "Professional Certificate",
        "degree": "Meta Back-End Developer",
        "university": "Coursera"
      },
      {
        "date": "Degree",
        "degree": "Bachelor Degree in CS and Stats",
        "university": "University of Toronto",
        "description": "Focus on AI and Machine Learning. Courses in Sofwarre Design, Software Tools and Systems Programming and Theory of Computation."
      }
    ]
  },
  "capabilities": {
    "heading": "Capabilities",
    "capabilities": [
      {
        "percent": "4+ years",
        "name": "Figma",
        "description": "Built design systems and application prototypes."
      },
      {
        "percent": "6+ years",
        "name": "React",
        "description": "Built component libraries and applications by leveraging libraries like Reactstrap, Mui and Ant Design."
      },
      {
        "percent": "4+ years",
        "name": "Typescript",
        "description": "Built full stack applications by leveraging the type-safe and efficient development processes it provides."
      },
      {
        "percent": "4+ years",
        "name": "Java",
        "description": "Built backend API's by leveraging Spring Boot and Spring Webflux."
      },
      {
        "percent": "6+ years",
        "name": "Python",
        "description": "Built ai powered backend API's by leveraging FastAPI and Flask."
      }
    ]
  },
  "expertise": {
    "heading": "Expertise with Technologies",
    "expertise": [
      {
        "name": "Angular (Analog.js)",
        "description": "Contributed to the online banking app, CEBA and mortgage orchestration portal for RBC."
      },
      {
        "name": "React (Next.js)",
        "description": "Contributed to an AI powered portal, education app and file management system for Oproma and Permion.ai."
      },
      {
        "name": "Spring Boot and Spring Webflux",
        "description": "Contributed to backend architecuture for Oproma and RBC."
      },
      {
        "name": "FastAPI",
        "description": "Contributed to backend architecuture for Permion.ai and Cleanlist.ai."
      },
      {
        "name": "Nest.js",
        "description": "Contributed to backend architecuture for Cleanlist.ai."
      }
    ]
  }
}
